Autodesk.Revit.DB.IExtension.IsMiterLocked(System.Int32)
Retrieves or set the miter locked status at the end.
Remarks: Property index must be 0 or 1 to indicate two ends, otherwise exceptions will be thrown.
For beams, only if the beam is extended and is mitered with other beams at the end,
it can be locked. Otherwise, the setting is invalid

Autodesk.Revit.DB.IExtension.HasMiter(System.Int32)
Retrieves the miter status at the end
Remarks: Property index must be 0 or 1 to indicate two ends, otherwise exceptions will be thrown.
For beams, this can check whether the beam is mitered with other beams at the end

Autodesk.Revit.DB.IExtension.SymbolicExtended(System.Int32)
Retrieves or set the symbolic extension status at the end
Remarks: Property index must be 0 or 1 to indicate two ends, otherwise exceptions will be thrown.
For beams, symbolic extension setting only works when the beam is extended, mitered, and miter locked
at the end. Otherwise the setting is invalid

Autodesk.Revit.DB.IExtension.Extended(System.Int32)
Retrieves or set the extension status at the end
Remarks: Property index must be 0 or 1 to indicate two ends, otherwise exceptions will be thrown.
For beams, if the beam extension status is changed, other status such as
the symbolic extension status, miter status, miter locked status, and
other beams extension status will be changed automatically at the same time.
This change can protect that a join can have up to two extended beams, if
there are two extended beams at the join, they shall be mitered.

Autodesk.Revit.DB.IExtension
An interface that supports the additional operation for Extension Status